[
    {
        "title": "Biome and Terrain Generation",
        "desc": "Seedra implements full terrain and biome generation for Legacy Console Edition. Generate biome data for entire worlds, create visual biome maps, and search for specific biome combinations quickly and efficiently. The library simulates Minecraft's noise terrain generation algorithms to produce accurate terrain in a convenient and reusable way.",
        "img_src": "biomes.png",
        "img_caption": "Example biome map generated by Seedra at 1:1 scale",
        "p1": "Generate biome data for any seed, version, and world size",
        "i1": "tabler-trees",
        "p2": "Simulate 1:1 terrain generation for Legacy Console Edition",
        "i2": "terrain",
        "p3": "Easily write efficient code for biome and terrain generation",
        "i3": "api"
    },
    {
        "title": "Find Structures Easily",
        "desc": "The structure generation system can accurately locate Minecraft structures for any given seed by replicating the game's structure generation algorithms. Once a structure is located, its internal layout can be generated with room arrangements, pathways, and loot chest locations matching their in-game counterparts.",
        "img_src": "structures.png",
        "img_caption": "Analyze structure layouts including room types and exact positions",
        "p1": "Configurable layout detail, from full to partial layouts",
        "i1": "tabler-settings-code",
        "p2": "Validated manually across hundreds of seeds for accuracy",
        "i2": "tabler-filter-check",
        "p3": "Enables loot and resource analysis within located structures",
        "i3": "tabler-info-hexagon"
    },
    {
        "title": "Find Loot",
        "desc": "The loot generation code can accurately determine the contents of any chest in the world based on the given Minecraft seed. By following Minecraft's exact sequence of generating the world, the code ensures that each chest's contents match what would appear in-game for the same seed including the correct enchantments.",
        "img_src": "loot.png",
        "img_caption": "Accurately generates loot contents for structures",
        "p1": "Computes exact chest slot contents for any given structure",
        "i1": "tabler-current-location",
        "p2": "Produces the actual in-game loot for that structure",
        "i2": "tabler-world-pin",
        "p3": "Supports console and version specific enchantments",
        "i3": "tabler-book"
    },
    {
        "title": "Highly Optimized & Thread-Safe",
        "desc": "Designed for performance and reliability, Seedra is built with multithreading in mind to fully utilize modern multi-core processors. The library's thread-safe architecture allows concurrent operations without data corruption. It provides a clean and easy-to-use API, making it simple to integrate into larger applications or systems that require efficient seed analysis and world generation capabilities.",
        "img_src": "optimize.png",
        "img_caption": "Optimized for speed and stability in multithreaded environments",
        "p1": "Fully utilizes available CPU cores for maximum performance",
        "i1": "tabler-cpu",
        "p2": "Thread-safe design ensures stable operation without crashes",
        "i2": "tabler-progress-check",
        "p3": "Provides a clean, easy-to-use API for integration with other systems",
        "i3": "tabler-apps-filled"
    }
]